---
kind: property
id: P:Autodesk.Revit.DB.PlanCircuitSet.IsEmpty
source: html/c4c21a6a-dcb0-f1b3-ef86-465455553d87.htm
---
# Autodesk.Revit.DB.PlanCircuitSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.